Autodesk.Revit.DB.Architecture.TopographySurface.IsValidFaceSet(System.Collections.Generic.IList{Autodesk.Revit.DB.PolymeshFacet},System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Identifies whether the facets can construct a valid topography surface.
facets:
The facets to be checked.
points:
A collection of points.
Returns:
True if the facets are valid, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There are no points in the input points set.
-or-
There were not enough points to form a valid region (at least 3 are required), or the points were collinear ignoring elevation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019.2

Autodesk.Revit.DB.Architecture.TopographySurface.GetHostedSubRegionIds
Gets the ids of all subregion elements hosted on this topography surface.
Remarks:
This applies to a TopographySurface element (not a SiteSubRegion or a topography surface associated with a BuildingPad).
This applies to TopographySurface and SiteSubRegion elements.
Returns:
The hosted subregion ids.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This element is not a TopographySurface.
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.AsSiteSubRegion
Obtains the subregion object represented by this element.
Remarks:
This applies to TopographySurface and SiteSubRegion elements.
Returns:
The SiteSubRegion element. If this does not represent a SiteSubRegion, this will be null.
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.FindPoints(Autodesk.Revit.DB.Outline)
Filters and returns only the points of the topography surface which lie within the input bounding box.
Remarks:
This applies to TopographySurface, SiteSubRegion, and the topography surface associated with a BuildingPad element.
boundingBox:
The 3D bounding box.
Returns:
The result points within the 3D bounding box
Throws Autodesk.Revit.Exceptions.ArgumentException:
boundingBox is an empty Outline.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.GetInteriorPoints
Gets all of the points that are not boundary points for the topography surface.
Remarks:
This applies to TopographySurface, SiteSubRegion, and the topography surface associated with a BuildingPad element.
For a SiteSubRegion, this returns the points inherited from the host TopographySurface.
For the topography surface associated with a BuildingPad element, this returns an empty collection.
Returns:
The collection of interior points.
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.GetBoundaryPoints
Gets the points which are on the boundary of the topography surface.
Remarks:
This applies to TopographySurface, SiteSubRegion, and the topography surface associated with a BuildingPad element.
For a SiteSubRegion, this returns the points from a representation of the region's boundary.
For the topography surface associated with a BuildingPad element, this returns the points from the sketch of this topography surface.
Returns:
The collection of boundary points.
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.ContainsPoint(Autodesk.Revit.DB.XYZ)
Identifies whether the given point exists in the topography surface.
Remarks:
The given point will be evaluated in XYZ. If a point matches the XY location, but not the elevation, this function still returns false.
This applies to TopographySurface and SiteSubRegion elements.
point:
The point to be checked.
Returns:
True if the input point exists in the topography surface, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.IsBoundaryPoint(Autodesk.Revit.DB.XYZ)
Identifies whether the given point is an existing boundary point of the current topography surface.
Remarks:
This applies to TopographySurface, SiteSubRegion, and the topography surface associated with a BuildingPad element.
The given point will be evaluated in XYZ. If a point matches the XY location, but not the elevation, an ArgumentException will be thrown
if this point does not exist in current topography surface.
point:
The point to be checked.
Returns:
Returns true if a given point is an existing boundary point.
For TopographySurface and SiteSubRegion elements, it returns false if the given point is an existing interior point of current topography surface.
For the topography surface associated with a BuildingPad element, it always returns true if the point is a part of the element (all points are boundary
points for the topography surface associated with a BuildingPad element).
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point does not exist in the current topography surface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.GetPoints
Gets the points that define this topography surface.
Remarks:
This applies to TopographySurface, SiteSubRegion, and the topography surface associated with a BuildingPad element.
For a SiteSubRegion, this returns the points from a representation of the region's boundary as well as the points inherited from the host TopographySurface.
For the topography surface associated with a BuildingPad element, this returns the points from the sketch of this topography surface(there are no interior points for this topography surface).
Returns:
The collection of points.
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.ArePointsDistinct(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Identify whether the input points are distinct in XY location.
points:
The points set to be checked.
Returns:
True if all points are distinct after ignoring the elevations, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There are no points in the input points set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.IsValidRegion(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Identify whether the points can construct a valid region for a topography surface.
points:
The points set to be checked.
Returns:
True if the size of points is not less than 3 and the points are not collinear after projecting to XY plane, that is, ignoring the elevation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There are no points in the input points set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.ChangePointsElevation(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Double)
Changes the elevation value for points
Remarks:
If none of the points in the collection doesn's exist, an exception will be thrown.
This function ignores input points that do not exist, unless all of the input points do not exist, which will result in an exception.
This applies to a TopographySurface element (not a SiteSubRegion or a topography surface associated with a BuildingPad), which shoule be in an active TopographyEditScope.
points:
The points to be modified.
elevationValue:
The new elevation value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There are no points in the input points set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for elevationValue must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This element is not a TopographySurface.
-or-
The points of this topography surface are not editable.
-or-
The TopographySurface element is not in an active TopographyEditScope.
Modification cannot be made on this TopographySurface.
-or-
None of the input points exists in the current TopographySurface.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this TopographySurface is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this TopographySurface is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this TopographySurface has no open transaction.
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.ChangePointElevation(Autodesk.Revit.DB.XYZ,System.Double)
Changes the elevation value for a point.
Remarks:
If the point doesn't exist in the current TopographySurface, an exception will be thrown.
This applies to a TopographySurface element (not a SiteSubRegion or a topography surface associated with a BuildingPad), which should be in an active TopographyEditScope.
point:
The point to be modified.
elevationValue:
The new elevation value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point does not exist in the current topography surface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for elevationValue must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This element is not a TopographySurface.
-or-
The points of this topography surface are not editable.
-or-
The TopographySurface element is not in an active TopographyEditScope.
Modification cannot be made on this TopographySurface.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this TopographySurface is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this TopographySurface is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this TopographySurface has no open transaction.
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.MovePoints(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.XYZ)
Moves a collection of points in a topography surface by a designated vector.
Remarks:
The points which don't exist in the current TopographySurface will be ignored.
This function ignores input points that do not exist, unless all of the input points do not exist, which will result in an exception.
This applies to a TopographySurface element (not a SiteSubRegion or a topography surface associated with a BuildingPad), which shoule be in an active TopographyEditScope.
movedPoints:
The points to be moved.
moveVector:
The vector which describes the distance and direction for the move.
Note that the Z value represents a change in elevation, pass Z=0 to move the point without changing the elevation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There are no points in the input points set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This element is not a TopographySurface.
-or-
The points of this topography surface are not editable.
-or-
The TopographySurface element is not in an active TopographyEditScope.
Modification cannot be made on this TopographySurface.
-or-
None of the input points exists in the current TopographySurface.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this TopographySurface is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this TopographySurface is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this TopographySurface has no open transaction.
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.MovePoint(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Moves a point in a TopographySurface to a new designated location.
Remarks:
If targetPt exists, the movedPt will be deleted. That means if movedPoint is moved to become a duplicate of an existing
point, movedPoint will be deleted instead becuase both points cannot exist at the same location.
This applies to a TopographySurface element (not a SiteSubRegion or a topography surface associated with a BuildingPad), which shoule be in an active TopographyEditScope.
movedPoint:
The point to be moved.
targetPoint:
The new designated location of this point will move to.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point does not exist in the current topography surface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This element is not a TopographySurface.
-or-
The points of this topography surface are not editable.
-or-
The TopographySurface element is not in an active TopographyEditScope.
Modification cannot be made on this TopographySurface.
-or-
The input point doesn't exist in the current TopographySurface.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this TopographySurface is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this TopographySurface is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this TopographySurface has no open transaction.
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.DeletePoints(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Deletes points from a Topography surface.
Remarks:
Points will be deleted if they matched in XY.
This function ignores input points that do not exist, unless all of the input points do not exist, which will result in an exception.
This applies to a TopographySurface element (not a SiteSubRegion or a topography surface associated with a BuildingPad), which shoule be in an active TopographyEditScope.
points:
A collection of points to be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There are no points in the input points set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This element is not a TopographySurface.
-or-
The topography surface is not editable.
-or-
The TopographySurface element is not in an active TopographyEditScope.
Modification cannot be made on this TopographySurface.
-or-
The points of this topography surface are not editable.
-or-
None of the input points exists in the current TopographySurface.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this TopographySurface is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this TopographySurface is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this TopographySurface has no open transaction.
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.AddPoints(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Adds points to a topography surface.
Remarks:
If an input point already exists in the surface at the same XY location, the point will not be added.
The document will be regenerated by this function.
This applies to a TopographySurface element (not a SiteSubRegion or a topography surface associated with a BuildingPad), which should be in an active TopographyEditScope.
points:
A collection of points to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There are no points in the input points set.
-or-
One or more points shared the same XY location (even with different elevations). This is not permitted for topography surfaces.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This element is not a TopographySurface.
-or-
The topography surface is not editable.
-or-
The points of this topography surface are not editable.
-or-
The TopographySurface element is not in an active TopographyEditScope.
Modification cannot be made on this TopographySurface.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this TopographySurface is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this TopographySurface is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this TopographySurface has no open transaction.

Autodesk.Revit.DB.Architecture.TopographySurface.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{Autodesk.Revit.DB.PolymeshFacet})
Creates a new topography surface element from facets and adds it to the document.
Remarks:
The document will be regenerated during the creation of this topography surface element.
The topography surface created by facet cannot modify its triangle points and facets.
document:
The document to be modified.
points:
A collection of points.
The points represent an enclosed area in the XY plane.
facets:
Triangle facets composing a polygon mesh.
Every facet contains 3 integers representing vertex indices.
Returns:
The new topography surface.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
There are invalid facets. Facets with more than two points with same x, y are not allowed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2019.2

Autodesk.Revit.DB.Architecture.TopographySurface.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Creates a new topography surface element and adds it to the document.
Remarks:
The document will be regenerated during the creation of this topography surface element.
document:
The document to be modified.
points:
A collection of points.
The points represent an enclosed area in the XY plane.
There can be only one point in the same XY location.
Returns:
The new topography surface.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
There are no points in the input points set.
-or-
There were not enough points to form a valid region (at least 3 are required), or the points were collinear ignoring elevation.
-or-
One or more points shared the same XY location (even with different elevations). This is not permitted for topography surfaces.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.MaterialId
The id of the material applied to this element.
Remarks:
This applies to TopographySurface and SiteSubRegion elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The materialId cannot map to a valid material element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.AssociatedBuildingPadId
The element id of the building pad which causes this topography surface to be formed.
Remarks:
InvalidElementId returned signals that there is no associated building pad.
Since:
2015

Autodesk.Revit.DB.Architecture.TopographySurface.IsAssociatedWithBuildingPad
Identifies if this element represents a topography surface associated with a building pad.
Since:
2015

Autodesk.Revit.DB.Architecture.TopographySurface.IsSiteSubRegion
Identifies if this element represents a subregion.
Since:
2014

Autodesk.Revit.DB.Architecture.TopographySurface.ArePointsEditable
Identifies whether the points of this topography surface can be edited independently.
Topography surfaces created from external data will not allow editing of individual points.
Since:
2019

Autodesk.Revit.DB.Architecture.TopographySurface
Represents a TopographySurface element.
Remarks:
A TopographySurface element in the Revit API represents:
An actual topography surface which can have an arbitrary boundary and collection of points.A SiteSubRegion element bounded by a sketch.A topography surface created automatically by the introduction of a BuildingPad element.
Identify a subregion with the IsSiteSubRegion property, and access the object that provides interfaces to manipulate the subregion via AsSiteSubRegion().
Identify a topography surface associated with a building pad with the isAssociatedWithBuildingPad property, and access the associated BuildingPad element via the property AssociatedBuildingPadId.
If the element does represent a subregion or a topography surface associated with a building pad, some methods of this class are inapplicable.